# LAB 02 - Pandas Library
###### a. k. a. 모든 데이터 가져오는 방법 모음
## #03. DataFrame 자료형

In [ ]:
# series 자료형에서는 행을 읽고 열을 읽는 반면에
# dataframe 자료형에서는 열을 먼저 접근한 후에 행에 접근한다
    # -> dataframe: 열을 우선으로 접근함!!
    # 열 이름: index label
    # 행 이름: column names
        # 각 행(Fields or Column)마다 각 변수들이 지정됨!
            # 각 변수 안에는 해당 데이터들이 세로로 나열되 있는거고 ㅇㅇ

# DataFrame 생성방법
    # 파이썬 자료형을 변환하는 방법:
        # 2차원 리스트
        # 리스트를 원소로 갖는 딕셔너리
        # 딕셔너리를 원소로 갖는 리스트
    # 외부에서 수집한 데이터로부터 생성하는 방법:
        # csv 파일로부터 가져오기 (쉼표로 구분)
        # 엑셀 파일 (*.xlsx)로부터 가져오기
        # 데이터베이스로부터 가져오기 (SQL)
        # 웹 데이터 수집하기 (OpenAPI 연동, 웹 크롤링)
            # 웹에서 수집한 데이터의 경우:
            # 딕셔너리를 원소로 갖는 리스트로 정리한 후
            # DataFrame으로 변환해야 됨!

### 라이브러리 참조

In [2]:
from pandas import DataFrame, read_csv, read_excel

### DataFrame 생성하기(1) - 2차원 리스트를 DataFrame으로 변환

In [3]:
# 특별한 옵션을 지정하지 않는 한, 인덱스는 0부터 시작되는 일련번호 형식으로 구성ㄷ굄

# 1. 어느 학습의 성적표를 표편한 2차원 리스트:
grade_data = [
    [1, "남자", 98, 77, 88, 64],
    [2, "여자", 88, 90, 62, 72],
    [1, "남자", 92, 70, 83, 79],
    [3, "여자", 63, 60, 31, 70],
    [4, "남자", 75, 50, 90, 88]
]

# 2. 2차원 리스트를 데이터프레임으로 변환해서
# -> 학생 별 점수 표현하기:
df = DataFrame(grade_data)
df

   0   1   2   3   4   5
0  1  남자  98  77  88  64
1  2  여자  88  90  62  72
2  1  남자  92  70  83  79
3  3  여자  63  60  31  70
4  4  남자  75  50  90  88

In [4]:
# 3. 인덱스랑 컬럼 이름 지정하기

# 인덱스 이름으로 사용할 리스트 생성:
i_names = ['철수', '영희', '민철', '수현', '호영']

# 컬럼 이름으로 사용할 리스트 생성:
c_names = ['학년', '성별', '국어', '영어', '수학', '과학']

# 인덱스랑 컬럼 이름 지정하기:
df = DataFrame(grade_data, index = i_names, columns = c_names)
df

    학년  성별  국어  영어  수학  과학
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

### DataFrame 생성하기(2) - 리스트를 원소로 가지는 딕셔너리로

In [5]:
# 1. 어느 학급의 성적을 표현한 딕셔너리 예시:
grade_dic = {
    "학년": [1, 2, 1, 3, 4],
    "성별": ["남자", "여자", "남자", "여자", "남자"],
    "국어": [98, 88, 92 ,63 ,75],
    "영어": [77, 90, 70, 60, 50],
    "수학": [88, 62, 83, 31, 90],
    "과학": [64, 72, 79, 70, 88]
}

# 2. 딕셔너리의 key가 컬럼(열) 이름이 됨!:
df = DataFrame(grade_dic)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

In [6]:
# 3. 인덱스 지정하가:
df = DataFrame(grade_dic, index = ['철수', '영희', '민철', '수현', '호영'])

# 4. 인덱스 제목도 지정하기:
df.index.name = '이름'
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

### DataFrame 생성하기(3) - 딕셔너리를 원소로 가지는 리스트

In [7]:
# 1.
grade_list = [
    {"이름": "철수", "학년": 1, "성별": "남자", "국어": 98, "영어": 98, "수학": 88, "과학": 64},
    {"이름": "영희", "학년": 2, "성별": "여자", "국어": 88, "영어": 90, "수학": 62, "과학": 72},
    {"이름": "민철", "학년": 1, "성별": "남자", "국어": 92, "영어": 70, "수학": 83, "과학": 79},
    {"이름": "수현", "학년": 3, "성별": "여자", "국어": 63, "영어": 60, "수학": 31, "과학": 70},
    {"이름": "호영", "학년": 4, "성별": "남자", "국어": 75, "영어": 50, "수학": 90, "과학": 88}
]

# 2.
df = DataFrame(grade_list)
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  98  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [8]:
# 3-1. 이미 생성된 DataFrame의 특정 컬럼을 index로 지정하는 법:
    # 원본엔 영향 x, 변경사항이 적용된 복사본으로 리턴됨
df2 = df.set_index("이름")
df2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  98  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [9]:
# 3-2. 복사본을 생성 안하고 원본에 변경사항 반영하는 법:
    # 리턴값이 없음!
    # 근데, 원본 데이터를 변경하는 건 권장 안함 
df.set_index('이름', inplace=True)
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  98  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [10]:
# 3-3. 인덱스 해제하기:
    # 인덱스를 일반 컬럼으로 되돌린 복사본을 리턴한다.
    # 일련번호 형식의 인덱스가 새롭게 생성된다.
    # 마찬가지로 inplace=True 파라미터를 사용하면 리턴되는 객체 없이 원본에 즉시 반영된다.
df3 = df.reset_index()
df3

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  98  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [11]:
# 3-4. reset_index() 사용 시 주의사항!
    # reset_index()는 기존의 인덱스를 컬럼으로 되돌리면서 일련번호 인덱스를 새롭게 만듬!
    # 때문에 df3에서 인덱스를 제거하면 오히려 새로운 컬럼이 추가되는 결과를 가져오게 된다.
df3.reset_index()

   index  이름  학년  성별  국어  영어  수학  과학
0      0  철수   1  남자  98  98  88  64
1      1  영희   2  여자  88  90  62  72
2      2  민철   1  남자  92  70  83  79
3      3  수현   3  여자  63  60  31  70
4      4  호영   4  남자  75  50  90  88

In [12]:
# 3-5. 인덱스를 해제하면서 기존 인덱스 제거하기:
    # drop=True 파라미터를 적용하면 기존의 인덱스를 일반 컬럼으로 변환하지 않고 삭제한다
    # 하지만, 일련번호 형식의 인덱스가 새로 생성된다!
        # 모든 DataFrame에 인덱스는 항상 존재해야 함
df3.reset_index(drop=True)

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  98  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

### 외부 파일로부터 데이터프레임 생성

In [14]:
# 1. CSV 파일을 데이터 프레임으로 가져오기
    # pandas의 read_csv() 함수를 사용한다
    # 로컬에 위치한 파일을 상대, 절대 경로 방식으로 가져올 수 있으며, 온라인 상의 파일의 URL을 통해 가져올 수도 있다.
    # CSV 파일의 첫 행이 데이터 프레임의 컬럼 이름으로 사용된다
df = read_csv(
    "https://data.hossam.kr/data/grade.csv", encoding = "euc-kr"
)
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

In [15]:
# 2. 인덱스로 사용할 열의 이름 지정하기:
    # 데이터 파일을 가져오는 과정에서 인덱스로 사용할 열 이름을 미리 지정할 수 있음
df = read_csv(
    "https://data.hossam.kr/data/grade.csv", encoding = "euc-kr", index_col='이름'
)
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

In [17]:
# 3. 엑셀 파일로부터 가져오는 법:
    # 엑셀 파일은 인코딩 지정 안해도 됨
df = read_excel(
    "https://data.hossam.kr/data/grade.xlsx", index_col='이름')
df

    학년  성별  국어   영어  수학  과학
이름
철수   1  남자  98   77  88  64
영희   2  여자  88  120  62  72
민철   1  남자  92   70  83  79
수현   3  여자  63   60  31  71
호영   4  남자  75   50  90  88
영호   4  남자  80   88  91  72
용식   2  남자  82   88  79  90
나영   1  여자  90   92  81  95
석영   1  남자  91   90  89  80